Tekla.Structures.Dialog.UIControls.WpfOkCreateCancel
Interaction logic for WPFOkCreateCancel.xaml
WpfOkCreateCancel

Tekla.Structures.Dialog.UIControls.WpfOkCreateCancel.#ctor
Constructor

Tekla.Structures.Dialog.UIControls.WpfOkCreateCancel.OkClicked
The OkClicked event is raised when the Ok button is clicked.

Tekla.Structures.Dialog.UIControls.WpfOkCreateCancel.CreateClicked
The ApplyClicked event is raised when the Apply button is clicked.

Tekla.Structures.Dialog.UIControls.WpfOkCreateCancel.CancelClicked
The CancelClicked event is raised when the Cancel button is clicked.

Tekla.Structures.Dialog.UIControls.WpfOkCreateCancel.InitializeComponent
InitializeComponent